app/controllers/referral_recipients_controller.rb

SELECT "referral_recipients".* FROM "referral_recipients" WHERE "referral_recipients"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @referral_recipient = ReferralRecipient.find(params[:id])