app/controllers/referral_candidates_controller.rb

  def index
    @referral_candidates = ReferralCandidate.all
---
SELECT "referral_candidates".* FROM "referral_candidates" ORDER BY times_used DESC

  def show
    @referral_candidate = ReferralCandidate.find(params[:id])
---
SELECT "referral_candidates".* FROM "referral_candidates" WHERE "referral_candidates"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @referral_candidate = ReferralCandidate.find(params[:id])
---
SELECT "referral_candidates".* FROM "referral_candidates" WHERE "referral_candidates"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @referral_candidate = ReferralCandidate.new(params[:referral_candidate])

    respond_to do |format|
      if @referral_candidate.save
---
INSERT INTO "referral_candidates" ("created_at", "num_reports", "referral_code", "times_used", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @referral_candidate = ReferralCandidate.find(params[:id])

    respond_to do |format|
      if @referral_candidate.update_attributes(params[:referral_candidate])
---
SELECT "referral_candidates".* FROM "referral_candidates" WHERE "referral_candidates"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "referral_candidates" SET "num_reports" = '2', "times_used" = '0', "updated_at" = '2012-06-30 22:06:04.954991' WHERE "referral_candidates"."id" = 1