app/controllers/referral_recipients_controller.rb

  def index
    @referral_recipients = ReferralRecipient.all
---
SELECT "referral_recipients".* FROM "referral_recipients"

  def show
    @referral_recipient = ReferralCandidate.where(:website => "Groupon").order("times_used").find(:first)
    @referral_recipient.times_used = (@referral_recipient.times_used.to_i + 1).to_s
    @referral_recipient.save
---
SELECT "referral_candidates".* FROM "referral_candidates" WHERE "referral_candidates"."website" = 'Groupon' ORDER BY times_used LIMIT 1
UPDATE "referral_candidates" SET "num_reports" = '0', "times_used" = '1', "updated_at" = '2012-07-01 04:35:46.041076' WHERE "referral_candidates"."id" = 2

  def edit
    @referral_recipient = ReferralRecipient.find(params[:id])
---
SELECT "referral_recipients".* FROM "referral_recipients" WHERE "referral_recipients"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @referral_recipient = ReferralRecipient.new(params[:referral_recipient])

    respond_to do |format|
      if @referral_recipient.save
---
INSERT INTO "referral_recipients" ("created_at", "referral_code", "updated_at", "website") VALUES (?, ?, ?, ?)  [["created_at", Sat, 30 Jun 2012 23:42:45 UTC +00:00], ["referral_code", ""], ["updated_at", Sat, 30 Jun 2012 23:42:45 UTC +00:00], ["website", ""]]