app/controllers/sessions_controller.rb

	def create
	    user = User.find_by_name(params[:session][:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'RealAaron' LIMIT 1